src/lejeune-vita.tex
% Created 2024-05-08 Wed 19:02
% Intended LaTeX compiler: pdflatex
\documentclass[12pt,a4paper]{awesome-cv}


\usepackage[defernumbers=true,style=numeric,sorting=ydnt]{biblatex}
\addbibresource{lejeune.bib}
\defbibheading{cvbibsection}[\bibname]{\cvsubsection{#1}}
\renewcommand{\acvHeaderSocialSep}{\enskip\cdotp\enskip}
\renewcommand{\acvHeaderIconSep}{~}
\renewcommand*{\bodyfontlight}{\sourcesanspro}
\renewcommand*{\bibfont}{\paragraphstyle}
\renewcommand*{\entrylocationstyle}[1]{{\fontsize{10pt}{1em}\bodyfontlight\slshape\color{awesome} #1}}
\renewcommand*{\subsectionstyle}{\entrytitlestyle}
\renewcommand*{\headerquotestyle}[1]{{\fontsize{8pt}{1em}\bodyfont #1}}
\setcounter{secnumdepth}{1}
\fontdir[fonts/]
\colorlet{awesome}{awesome-concrete}
\setbool{acvSectionColorHighlight}{false}
\colorizelinks[awesome-skyblue]
\name{Laurent}{Lejeune,PhD}
\position{Machine Learning Researcher · Computer Vision · Computer Scientist (7 YOE)}
\photo[right,noedge]{./images/me.jpg}
\address{Lyon, France}
\email{me@lejeunel.org}
\mobile{+33 7 83 39 54 11}
\github{lejeunel}
\linkedin{laurent-lejeune-a3b83044}
\hypersetup{
 pdfauthor={Laurent Lejeune,PhD},
 pdftitle={Machine Learning Researcher · Computer Vision · Computer Scientist (7 YOE)},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.2 (Org mode 9.7)}, 
 pdflang={English}}
\begin{document}

\makecvheader
\makecvfooter{\today\\~}{}{\thepage\\~}

\cvsection{Key skills}
\label{sec:org787f059}
\begin{cvskills}
\cvskill{Technology}{Broad and deep IT skills, computer vision and machine learning frameworks, relational databases, cloud computing, API for data management, programming languages, etc.}
\cvskill{Machine Learning}{Deep Learning, computer vision, graph optimization, self/semi-supervised methods, metric learning, novelty detection, etc.}
\cvskill{Cloud Computing}{AWS architecture, infrastructure, development and security.}
\cvskill{Data Engineering}{Extensive skills in managing large and complex datasets: Relational database (SQL), REST API.}
\cvskill{Work ethics}{Strong focus on quality: write clear, tested, and easy to maintain documentation and software. Accountable team-player. Excellent at listening, formalizing complex problems and anticipating scientific and business needs.}
\cvskill{Communication}{Excellent written and spoken communication skills, extensive public speaking and writing in academic and industrial settings. Able to express complex technical matter across disciplinary frontiers.}
\cvskill{Research}{Ph.D. in Computer Vision and Machine Learning. R\&D in crop science and health industry.}
\cvskill{Languages}{French (native), English (100\%)}
\end{cvskills}
\cvsection{Professional and academic highlights}
\label{sec:orgadedac4}

\begin{cvparagraph}
\begin{itemize}
\item Research \& Development data scientist at \href{https://www.bayer.com/en/agriculture}{Bayer Crop Science}
\begin{itemize}
\item Developed a novel computer vision and machine learning strategy to allow the exploration of fungicide chemical compound characterization through microscopy images.
\item Leveraged metric learning and computer vision methods to allow domain-experts to assess biological activity and phenotypical impact of compound treatments.
\item Focus on producing tools that are intuitive and easy to use for biologists.
\end{itemize}
\item Data engineering and cloud computing at \href{https://www.bayer.com/en/agriculture}{Bayer Crop Science}
\begin{itemize}
\item Designed and implemented a solution to store and retrieve large and complex datasets.
\item Use relational database system and Python framework to model complex relations between data items.
\item Developed a REST API to query, contribute, and annotate datasets.
\item Deployed service in the cloud (AWS), and managed security requirements.
\end{itemize}
\item Machine learning and computer vision
\begin{itemize}
\item Contributed novel methods on complex problems applied to medicine and biology.
\item Deep Learning models, Convolutional Neural Networks, graph optimization, bayesian methods etc.
\item Devised frameworks leveraging self/semi-supervised learning, metric learning, image and video segmentation, etc.
\end{itemize}
\item Contributions to the scientific community
\begin{itemize}
\item Author of multiple peer-reviewed (high-impact journals, conferences, workshops) articles.
\item Tools and methods with a broad range of use targetting the medical and biological domain.
\end{itemize}
\end{itemize}


\end{cvparagraph}
\cvsection{Experience}
\label{sec:orgfcd52a6}

\begin{cventries}

\cventry{Bayer Crop Science}{2021 -- 2023\hfill Bayer SAS, Lyon, France}{}{}{}

\cvsubentry
{R\&D in computer vision and machine learning}
{2021 -- 2023}
{\begin{cvitems}
\item Devise computer vision and machine learning methods to characterize compound-treatment on filamentous fungi from fluorescence microscopy images.
\item Leverage convolutional networks (deep learning) and metric learning to estimate biological activity of compounds in an interpretable manner.
\item Contribute to the elaboration of large-scale microscopy imaging protocol.
\end{cvitems}
}

\cvsubentry
{Data engineering}
{2021 -- 2023}
{\begin{cvitems}
\item Design a relational database model to store and query meta-data of imaging experiments.
\item Implement a backend in Python using Flask.
\item Implement a REST API to query and contribute data.
\item Deploy stack on cloud (AWS) and setup security layer (OAuth).
\item Designed and implemented a service to transfer large volumes of data from on-prem servers to cloud (S3 bucket) using task queues (Redis) and SQLite.
\end{cvitems}
}

\cventry{Heart Kinetics}{2012 -- 2016\hfill Brussels, Belgium}{}{}{}

\cvsubentry
{R\&D in image and signal processing}
{2012 -- 2016}
{\begin{cvitems}
\item Modelling of the cardiovascular system in
3D-\href{https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4274997/}{ballistocardiography}.
\item Develop and validate a blood flow model using MRI data.
\end{cvitems}
}

\cvsubentry
{Engineering an embedded device}
{2014 -- 2016}
{\begin{cvitems}
\item Hardware design (electrocardiogram, accelerometer and microcontroller)
\item Develop an embedded data logger for the acquisition of electrocardiogram ballistocardiogram
\end{cvitems}
}
\end{cventries}
\cvsection{Education and teaching}
\label{sec:orgba5ddb6}

\begin{cventries}

\cventry
{PhD in machine learning and biomedical engineering}
{Bern, Switzerland}
{ARTORG Center, University of Bern}
{Aug 2016 -- Feb 2021}
{\begin{cvitems}
\item Thesis:
\begin{itemize}
\item Title: Segmention of Video and Volumetric Medical Sequences at Frame-rate using Sparse Point-wise Supervision
\item Advisors: \href{https://scholar.google.com/citations?user=tG0ow2UAAAAJ\&hl=en\&oi=ao}{Raphael Sznitman}
\item Contributions:
\begin{itemize}
\item CNN training method to segment images using minimal annotations (a single 2D location per frame). Novel recursive bayesian strategy to estimate class-priors
in a self-supervised fashion.
\item Graph optimization framework inspired by multi-object tracking to infer the segmentation mask of objects on videos and volumes.
\end{itemize}
\end{itemize}
\item Teaching assistant: Signal and image processing.
\item M.S. project supervision of Jan Grossrieder: Exploration of unsupervised and weakly-supervised deep feature learning
\end{cvitems}
}

\cventry
{Master's thesis}
{Vancouver, Canada}
{University of British Columbia}
{Mar 2011 -- Oct 2011}
{\begin{cvitems}
\item Title: Gripping performance evaluation of upper limb prosthetic devices
\item Advisor: \href{https://www.linkedin.com/in/ezra-kwok-220b6411}{Ezra Kwok}
\item Contributions: Development of a physical apparatus and signal processing
tools for the evaluation of the gripping performances of upper limb
prosthetics.
\end{cvitems}
}

\cventry
{Minor in Biomedical Engineering}
{Lausanne, Switzerland}
{École polytechnique fédérale de Lausanne}
{Sep 2010 -- Feb 2011}
{\begin{cvitems}
\item Project:
\begin{itemize}
\item Title: Realistic Analytical Phantoms for Parallel Magnetic Resonance Imaging
\item Advisors: \href{https://scholar.google.com/citations?user=nKVDcQoAAAAJ\&hl=en}{Michael Unser}, \href{https://scholar.google.com/citations?user=esEKAi8AAAAJ\&hl=fr}{Matthieu Guerquin-Kern}
\end{itemize}
\item Courses: Bioinspired artificial intelligence, Biomaterials, Biomedical Signal Processing, Biometrics, Sensors in medical instrumentation, bioMEMS
\end{cvitems}
}

\cventry
{M.S. in Electrical Engineering (Signal and Image Processing)}
{Lausanne, Switzerland}
{École polytechnique fédérale de Lausanne}
{Sep 2009 -- May 2011}
{\begin{cvitems}
\item Project
\begin{itemize}
\item Title: Atrial Fibrillation signals classification using entropy measures.
\item Advisor: \href{https://scholar.google.com/citations?hl=en\&user=-0EP2zAAAAAJ}{J.-M. Vesin}
\end{itemize}
\item Courses: Advanced Signal Processing, Image Processing, Image Analysis
and Pattern Recognition, Microwaves, Optical Signal Processing, Architectures
for Information Processing, Image and Video Processing, Image Communication,
Media Security, Speech Processing
\end{cvitems}
}
\end{cventries}
\cvsection{Languages}
\label{sec:orgd9df58d}
\begin{cvskills}
\cvskill{French}{native}
\cvskill{English}{full professional proficiency}
\end{cvskills}
\cvsection{Software Skills}
\label{sec:org407fe6d}
\begin{cvskills}
\cvskill{Languages}{Python, C/C++, Golang, Bash, SQL, \LaTeX{}, etc.}
\cvskill{Machine Learning}{PyTorch, TensorFlow, Keras, Scikit-learn}
\cvskill{Image processing}{Scikit-image, Pillow}
\cvskill{Data science / engineering}{Jupyter, streamlit, matplotlib, SQLAlchemy}
\cvskill{Web}{HTML, CSS, Flask, Django, REST API}
\cvskill{Cloud}{AWS (ECS, cloud formation, RDS)}
\cvskill{Security}{OAuth with Azure Active Directories}
\cvskill{Operating Systems}{Linux, Windows}
\cvskill{Others}{Git, Docker}
\end{cvskills}
\cvsection{Publications}
\label{publications}
\nocite{*}
\printbibliography[heading=none]
\cvsection{References}
\label{sec:org140a70e}

\begin{cvparagraph}
Available by request.
\end{cvparagraph}
\end{document}
